//==========================================
//									buffer.h
//　制作者:AT11B192 No.17 小畠大季
//～～～～～～～～更新履歴～～～～～～～～～
//2020/02/10
// プログラム制作開始
//2020/02/18
// 関数コメントの記述
//～～～～～～～～～～～～～～～～～～～～～

#ifndef _BUFFER_H_
#define _BUFFER_H_

//===== インクルード部 =====
#include "bitmap.h"

//===== 定数・マクロ定義 =====
#define WINDOW_HEIGHT	(144)	// 画面の縦の大きさ
#define WINDOW_WIDTH	(416)	// 画面の横の大きさ


//===== 構造体宣言 =====

typedef struct
{
	HANDLE	Handle;
	COORD	BufferSize;
	COORD	Start_Coord;
	SMALL_RECT SR;
	CHAR_INFO Cell[WINDOW_HEIGHT][WINDOW_WIDTH];
} BUFFER;


//===== プロトタイプ宣言 =====

//--------------------------------------
//関数名：InitMainBuffer
//引　数：なし
//戻り値：なし
//内　容：メインバッファの初期化
//--------------------------------------
void InitMainBuffer(void);
//--------------------------------------
//関数名：InitBuffer
//引　数：BUFFER* (初期化したいバッファ)
//戻り値：なし
//内　容：バッファの初期化
//--------------------------------------
void InitBuffer(BUFFER*);
//--------------------------------------
//関数名：UpdateBuffer
//引　数：BUFFER*, IMAGE* int, int
//(書き込むバッファ、書き込みたい画像データ、書き込む座標(左上)(x座標、y座標))
//戻り値：なし
//内　容：ビットマップデータをバッファ上の指定した位置に書き込む
//--------------------------------------
void UpdateBuffer(BUFFER*, IMAGE*, int, int);
//--------------------------------------
//関数名：DrawBuffer
//引　数：なし
//戻り値：なし
//内　容：バッファを描画する
//--------------------------------------
void DrawBuffer(void);
//--------------------------------------
//関数名：EndBuffer
//引　数：なし
//戻り値：なし
//内　容：
//--------------------------------------
void EndBuffer(void);
//--------------------------------------
//関数名：CombineBuffer
//引　数：BUFFER* (書き込みたいバッファ)
//戻り値：なし
//内　容：メインバッファに指定したバッファを書き込む
//--------------------------------------
void CombineBuffer(BUFFER*);

#endif // !_BUFFER_H_

