//==========================================
//									  char.h
//　制作者:AT11B192 No.17 小畠大季
//～～～～～～～～更新履歴～～～～～～～～～
//2020/02/29
// プログラム制作開始
//～～～～～～～～～～～～～～～～～～～～～
#ifndef _CHARA_H_
#define _CHARA_H_

//===== 定数・マクロ定義 =====
#define CHARA_SIZE (10)	// 文字の大きさ


//===== プロトタイプ宣言 =====

//--------------------------------------
//関数名：InitChar
//引　数：なし
//戻り値：なし
//内　容：文字の前処理
//--------------------------------------
void InitChara(void);
//--------------------------------------
//関数名：UpdateChar
//引　数：なし
//戻り値：なし
//内　容：文字の更新
//--------------------------------------
void UpdateChara(void);
//--------------------------------------
//関数名：DrawChar
//引　数：なし
//戻り値：なし
//内　容：文字を表示する
//--------------------------------------
void DrawChara(void);
//--------------------------------------
//関数名：EndChar
//引　数：なし
//戻り値：なし
//内　容：文字の後処理
//--------------------------------------
void EndChara(void);
//--------------------------------------
//関数名：SetChar
//引　数：const char, int, int, int
//		(表示したい文字列、文字を表示する位置(x座標、y座標)、文字の間隔)
//戻り値：なし
//内　容：指定した位置に文字を表示する
//--------------------------------------
void SetChara(const char*, int, int, int);
//--------------------------------------
//関数名：SetNum
//引　数：const char, int, int, int
//		(表示したい数字、数字を表示する位置(x座標、y座標))
//戻り値：なし
//内　容：指定した位置に数字を表示する
//--------------------------------------
void SetNum(int, int, int);

#endif // !_CHARA_H_
