//------------------------------------------
//									cursor.h
//　制作者:AT11B192 No.17 小畠大季
//更新履歴～～～～～～～～～～～～～～～～～
//2020/02/29
// プログラム制作開始
//～～～～～～～～～～～～～～～～～～～～～
#ifndef _CURSOR_H_
#define _CURSOR_H_

//===== インクルード部 =====
#include <Windows.h>
#include "unit.h"

//===== 構造体宣言 =====

//--------------------------------------
//カーソル用構造体
//--------------------------------------
typedef struct
{
	COORD Pos;			// 座標
	bool bClick;		// クリックしているかどうか
	UNIT *pSelectUnit;	// 選択しているユニット
	int nFlame;			// アニメーション用カウンター
} CURSOR;

//===== プロトタイプ宣言 =====

//--------------------------------------
//関数名：InitCursor
//引　数：なし
//戻り値：なし
//内　容：カーソルの前処理
//--------------------------------------
void InitCursor(void);
//--------------------------------------
//関数名：UpdateCursor
//引　数：なし
//戻り値：なし
//内　容：カーソルの更新
//--------------------------------------
void UpdateCursor(void);
//--------------------------------------
//関数名：DrawCursor
//引　数：なし
//戻り値：なし
//内　容：カーソルを表示する
//--------------------------------------
void DrawCursor(void);
//--------------------------------------
//関数名：EndCursor
//引　数：なし
//戻り値：なし
//内　容：カーソルの後処理
//--------------------------------------
void EndCursor(void);
//--------------------------------------
//関数名：GetCursor_DK
//引　数：なし
//戻り値：CURSOR* (カーソル)
//内　容：カーソルのデータを渡す
//--------------------------------------
CURSOR* GetCursor_DK(void);

void SetCursorXY_DK(int, int);

#endif // !_CURSOR_H_
