//------------------------------------------
//									 enemy.h
//　制作者:AT11B192 No.17 小畠大季
//更新履歴～～～～～～～～～～～～～～～～～
//2020/02/28
// プログラム制作開始
//～～～～～～～～～～～～～～～～～～～～～
#ifndef _ENEMY_H_
#define _ENEMY_H_

//===== インクルード部 =====
#include "unit.h"

//===== 定数・マクロ定義 =====
#define MAX_ENEMY_UNIT_NUM	(5)	// 敵ユニットの最大数

//===== プロトタイプ宣言 =====

//--------------------------------------
//関数名：InitEnemy
//引　数：なし
//戻り値：なし
//内　容：味方ユニットの初期化
//--------------------------------------
void InitEnemy(void);
//--------------------------------------
//関数名：UpdateEnemy
//引　数：なし
//戻り値：なし
//内　容：味方ユニットの更新
//--------------------------------------
void UpdateEnemy(void);
//--------------------------------------
//関数名：DrawEnemy
//引　数：なし
//戻り値：なし
//内　容：敵ユニットを描画する
//--------------------------------------
void DrawEnemy(void);
//--------------------------------------
//関数名：EndEnemy
//引　数：なし
//戻り値：なし
//内　容：ユニットの後処理を行う
//--------------------------------------
void EndEnemy(void);
//--------------------------------------
//関数名：GetEnemyUnit
//引　数：なし
//戻り値：UNIT* (敵ユニット)
//内　容：敵ユニットのデータを渡す
//--------------------------------------
UNIT* GetEnemyUnit(void);
#endif // !_ENEMY_H_
