//------------------------------------------
//									player.h
//　制作者:AT11B192 No.17 小畠大季
//更新履歴～～～～～～～～～～～～～～～～～
//2020/02/28
// プログラム制作開始
//～～～～～～～～～～～～～～～～～～～～～
#ifndef _PLAYER_H_
#define _PLAYER_H_

//===== インクルード部 =====
#include "unit.h"

//===== 定数・マクロ定義 =====
#define MAX_PLAYER_UNIT_NUM	(5)	// 味方ユニットの最大数

//--------------------------------------
//関数名：InitPlayer
//引　数：なし
//戻り値：なし
//内　容：味方ユニットの初期化
//--------------------------------------
void InitPlayer(void);
//--------------------------------------
//関数名：UpdatePlayer
//引　数：なし
//戻り値：なし
//内　容：味方ユニットの更新
//--------------------------------------
void UpdatePlayer(void);
//--------------------------------------
//関数名：DrawPlayer
//引　数：なし
//戻り値：なし
//内　容：味方ユニットを描画する
//--------------------------------------
void DrawPlayer(void);
//--------------------------------------
//関数名：EndPlayer
//引　数：なし
//戻り値：なし
//内　容：味方ユニットの後処理を行う
//--------------------------------------
void EndPlayer(void);
//--------------------------------------
//関数名：GetPlayerUnit
//引　数：なし
//戻り値：UNIT* (味方ユニット)
//内　容：味方ユニットのデータを渡す
//--------------------------------------
UNIT* GetPlayerUnit(void);

void ResetPlayerAction(void);
void AddActionCnt(void);

#endif // !_PLAYER_H_
