//------------------------------------------
//									 title.h
//　制作者:AT11B192 No.17 小畠大季
//更新履歴～～～～～～～～～～～～～～～～～
//2020/02/21
// プログラム制作開始
//～～～～～～～～～～～～～～～～～～～～～
#ifndef _TITLE_H_
#define _TITLE_H_

//===== プロトタイプ宣言 =====

//--------------------------------------
//関数名：InitTitle
//引　数：なし
//戻り値：なし
//内　容：タイトル画面の初期化
//--------------------------------------
void InitTitle(void);
//--------------------------------------
//関数名：UpdateTitle
//引　数：なし
//戻り値：なし
//内　容：タイトル画面の更新
//--------------------------------------
void UpdateTitle(void);
//--------------------------------------
//関数名：DrawTitle
//引　数：なし
//戻り値：なし
//内　容：タイトル画面の描画
//--------------------------------------
void DrawTitle(void);
//--------------------------------------
//関数名：EndTitle
//引　数：なし
//戻り値：なし
//内　容：タイトル画面を終了する
//--------------------------------------
void EndTitle(void);

#endif // !_TITLE_H_
