//------------------------------------------
//									window.h
//　制作者:AT11B192 No.17 小畠大季
//更新履歴～～～～～～～～～～～～～～～～～
//2020/02/29
// プログラム制作開始
//～～～～～～～～～～～～～～～～～～～～～
#ifndef _WINDOW_H_
#define _WINDOW_H_

//===== 定数・マクロ定義 =====
#define TERRAIN_WINDOW_WIDTH	(120)	// 地形情報ウィンドウの幅
#define TERRAIN_WINDOW_HEIGHT	(30)	// 地形情報ウィンドウの高さ
#define UNIT_WINDOW_WIDTH		(240)	// ユニット情報ウィンドウの幅
#define UNIT_WINDOW_HEIGHT		(80)	// ユニット情報ウィンドウの高さ

//===== プロトタイプ宣言 =====

//--------------------------------------
//関数名：InitWindow
//引　数：なし
//戻り値：なし
//内　容：ウィンドウの前処理
//--------------------------------------
void InitWindow(void);
//--------------------------------------
//関数名：UpdateWindow
//引　数：なし
//戻り値：なし
//内　容：ウィンドウの更新
//--------------------------------------
void UpdateWindow(void);
//--------------------------------------
//関数名：DrawWindow
//引　数：なし
//戻り値：なし
//内　容：ウィンドウを表示する
//--------------------------------------
void DrawWindow(void);
//--------------------------------------
//関数名：EndWindow
//引　数：なし
//戻り値：なし
//内　容：ウィンドウの後処理
//--------------------------------------
void EndWindow(void);

#endif // !_WINDOW_H_
